PinguinoIDE/pinguino-compilers/linux/p8/share/gputils/header/p18f96j99.inc
;----- UEP1 Bits -----------------------------------------------------
EPSTALL          EQU  H'0000'
EPINEN           EQU  H'0001'
EPOUTEN          EQU  H'0002'
EPCONDIS         EQU  H'0003'
EPHSHK           EQU  H'0004'


;----- UEP2 Bits -----------------------------------------------------
EPSTALL          EQU  H'0000'
EPINEN           EQU  H'0001'
EPOUTEN          EQU  H'0002'
EPCONDIS         EQU  H'0003'
EPHSHK           EQU  H'0004'


;----- UEP3 Bits -----------------------------------------------------
EPSTALL          EQU  H'0000'
EPINEN           EQU  H'0001'
EPOUTEN          EQU  H'0002'
EPCONDIS         EQU  H'0003'
EPHSHK           EQU  H'0004'


;----- UEP4 Bits -----------------------------------------------------
EPSTALL          EQU  H'0000'
EPINEN           EQU  H'0001'
EPOUTEN          EQU  H'0002'
EPCONDIS         EQU  H'0003'
EPHSHK           EQU  H'0004'


;----- UEP5 Bits -----------------------------------------------------
EPSTALL          EQU  H'0000'
EPINEN           EQU  H'0001'
EPOUTEN          EQU  H'0002'
EPCONDIS         EQU  H'0003'
EPHSHK           EQU  H'0004'


;----- UEP6 Bits -----------------------------------------------------
EPSTALL          EQU  H'0000'
EPINEN           EQU  H'0001'
EPOUTEN          EQU  H'0002'
EPCONDIS         EQU  H'0003'
EPHSHK           EQU  H'0004'


;----- UEP7 Bits -----------------------------------------------------
EPSTALL          EQU  H'0000'
EPINEN           EQU  H'0001'
EPOUTEN          EQU  H'0002'
EPCONDIS         EQU  H'0003'
EPHSHK           EQU  H'0004'


;----- UEP8 Bits -----------------------------------------------------
EPSTALL          EQU  H'0000'
EPINEN           EQU  H'0001'
EPOUTEN          EQU  H'0002'
EPCONDIS         EQU  H'0003'
EPHSHK           EQU  H'0004'


;----- UEP9 Bits -----------------------------------------------------
EPSTALL          EQU  H'0000'
EPINEN           EQU  H'0001'
EPOUTEN          EQU  H'0002'
EPCONDIS         EQU  H'0003'
EPHSHK           EQU  H'0004'


;----- UEP10 Bits -----------------------------------------------------
EPSTALL          EQU  H'0000'
EPINEN           EQU  H'0001'
EPOUTEN          EQU  H'0002'
EPCONDIS         EQU  H'0003'
EPHSHK           EQU  H'0004'


;----- UEP11 Bits -----------------------------------------------------
EPSTALL          EQU  H'0000'
EPINEN           EQU  H'0001'
EPOUTEN          EQU  H'0002'
EPCONDIS         EQU  H'0003'
EPHSHK           EQU  H'0004'


;----- UEP12 Bits -----------------------------------------------------
EPSTALL          EQU  H'0000'
EPINEN           EQU  H'0001'
EPOUTEN          EQU  H'0002'
EPCONDIS         EQU  H'0003'
EPHSHK           EQU  H'0004'


;----- UEP13 Bits -----------------------------------------------------
EPSTALL          EQU  H'0000'
EPINEN           EQU  H'0001'
EPOUTEN          EQU  H'0002'
EPCONDIS         EQU  H'0003'
EPHSHK           EQU  H'0004'


;----- UEP14 Bits -----------------------------------------------------
EPSTALL          EQU  H'0000'
EPINEN           EQU  H'0001'
EPOUTEN          EQU  H'0002'
EPCONDIS         EQU  H'0003'
EPHSHK           EQU  H'0004'


;----- UEP15 Bits -----------------------------------------------------
EPSTALL          EQU  H'0000'
EPINEN           EQU  H'0001'
EPOUTEN          EQU  H'0002'
EPCONDIS         EQU  H'0003'
EPHSHK           EQU  H'0004'


;----- UEIE Bits -----------------------------------------------------
PIDEE            EQU  H'0000'
CRC5EE           EQU  H'0001'
CRC16EE          EQU  H'0002'
DFN8EE           EQU  H'0003'
BTOEE            EQU  H'0004'
BTSEE            EQU  H'0007'


;----- UIE Bits -----------------------------------------------------
URSTIE           EQU  H'0000'
UERRIE           EQU  H'0001'
ACTVIE           EQU  H'0002'
TRNIE            EQU  H'0003'
IDLEIE           EQU  H'0004'
STALLIE          EQU  H'0005'
SOFIE            EQU  H'0006'


;----- UCFG Bits -----------------------------------------------------
PPB0             EQU  H'0000'
PPB1             EQU  H'0001'
FSEN             EQU  H'0002'
UTRDIS           EQU  H'0003'
UPUEN            EQU  H'0004'
UOEMON           EQU  H'0006'
UTEYE            EQU  H'0007'


;----- RPOR0_1 Bits -----------------------------------------------------
RPO0R0           EQU  H'0000'
RPO0R1           EQU  H'0001'
RPO0R2           EQU  H'0002'
RPO0R3           EQU  H'0003'
RPO1R0           EQU  H'0004'
RPO1R1           EQU  H'0005'
RPO1R2           EQU  H'0006'
RPO1R3           EQU  H'0007'


;----- RPOR2_3 Bits -----------------------------------------------------
RPO2R0           EQU  H'0000'
RPO2R1           EQU  H'0001'
RPO2R2           EQU  H'0002'
RPO2R3           EQU  H'0003'
RPO3R0           EQU  H'0004'
RPO3R1           EQU  H'0005'
RPO3R2           EQU  H'0006'
RPO3R3           EQU  H'0007'


;----- RPOR4_5 Bits -----------------------------------------------------
RPO4R0           EQU  H'0000'
RPO4R1           EQU  H'0001'
RPO4R2           EQU  H'0002'
RPO4R3           EQU  H'0003'
RPO5R0           EQU  H'0004'
RPO5R1           EQU  H'0005'
RPO5R2           EQU  H'0006'
RPO5R3           EQU  H'0007'


;----- RPOR6_7 Bits -----------------------------------------------------
RPO6R0           EQU  H'0000'
RPO6R1           EQU  H'0001'
RPO6R2           EQU  H'0002'
RPO6R3           EQU  H'0003'
RPO7R0           EQU  H'0004'
RPO7R1           EQU  H'0005'
RPO7R2           EQU  H'0006'
RPO7R3           EQU  H'0007'


;----- RPOR8_9 Bits -----------------------------------------------------
RPO8R0           EQU  H'0000'
RPO8R1           EQU  H'0001'
RPO8R2           EQU  H'0002'
RPO8R3           EQU  H'0003'
RPO9R0           EQU  H'0004'
RPO9R1           EQU  H'0005'
RPO9R2           EQU  H'0006'
RPO9R3           EQU  H'0007'


;----- RPOR10_11 Bits -----------------------------------------------------
RPO10R0          EQU  H'0000'
RPO10R1          EQU  H'0001'
RPO10R2          EQU  H'0002'
RPO10R3          EQU  H'0003'
RPO11R0          EQU  H'0004'
RPO11R1          EQU  H'0005'
RPO11R2          EQU  H'0006'
RPO11R3          EQU  H'0007'


;----- RPOR12_13 Bits -----------------------------------------------------
RPO12R0          EQU  H'0000'
RPO12R1          EQU  H'0001'
RPO12R2          EQU  H'0002'
RPO12R3          EQU  H'0003'
RPO13R0          EQU  H'0004'
RPO13R1          EQU  H'0005'
RPO13R2          EQU  H'0006'
RPO13R3          EQU  H'0007'


;----- RPOR14_15 Bits -----------------------------------------------------
RPO14R0          EQU  H'0000'
RPO14R1          EQU  H'0001'
RPO14R2          EQU  H'0002'
RPO14R3          EQU  H'0003'
RPO15R0          EQU  H'0004'
RPO15R1          EQU  H'0005'
RPO15R2          EQU  H'0006'
RPO15R3          EQU  H'0007'


