PinguinoIDE/pinguino-compilers/linux/p8/share/gputils/header/p18f96j99.inc
;----- RPOR16_17 Bits -----------------------------------------------------
RPO16R0          EQU  H'0000'
RPO16R1          EQU  H'0001'
RPO16R2          EQU  H'0002'
RPO16R3          EQU  H'0003'
RPO17R0          EQU  H'0004'
RPO17R1          EQU  H'0005'
RPO17R2          EQU  H'0006'
RPO17R3          EQU  H'0007'


;----- RPOR18_19 Bits -----------------------------------------------------
RPO18R0          EQU  H'0000'
RPO18R1          EQU  H'0001'
RPO18R2          EQU  H'0002'
RPO18R3          EQU  H'0003'
RPO19R0          EQU  H'0004'
RPO19R1          EQU  H'0005'
RPO19R2          EQU  H'0006'
RPO19R3          EQU  H'0007'


;----- RPOR20_21 Bits -----------------------------------------------------
RPO20R0          EQU  H'0000'
RPO20R1          EQU  H'0001'
RPO20R2          EQU  H'0002'
RPO20R3          EQU  H'0003'
RPO21R0          EQU  H'0004'
RPO21R1          EQU  H'0005'
RPO21R2          EQU  H'0006'
RPO21R3          EQU  H'0007'


;----- RPOR22_23 Bits -----------------------------------------------------
RPO22R0          EQU  H'0000'
RPO22R1          EQU  H'0001'
RPO22R2          EQU  H'0002'
RPO22R3          EQU  H'0003'
RPO23R0          EQU  H'0004'
RPO23R1          EQU  H'0005'
RPO23R2          EQU  H'0006'
RPO23R3          EQU  H'0007'


;----- RPOR24_25 Bits -----------------------------------------------------
RPO24R0          EQU  H'0000'
RPO24R1          EQU  H'0001'
RPO24R2          EQU  H'0002'
RPO24R3          EQU  H'0003'
RPO25R0          EQU  H'0004'
RPO25R1          EQU  H'0005'
RPO25R2          EQU  H'0006'
RPO25R3          EQU  H'0007'


;----- RPOR26_27 Bits -----------------------------------------------------
RPO26R0          EQU  H'0000'
RPO26R1          EQU  H'0001'
RPO26R2          EQU  H'0002'
RPO26R3          EQU  H'0003'
RPO27R0          EQU  H'0004'
RPO27R1          EQU  H'0005'
RPO27R2          EQU  H'0006'
RPO27R3          EQU  H'0007'


;----- RPOR28_29 Bits -----------------------------------------------------
RPO28R0          EQU  H'0000'
RPO28R1          EQU  H'0001'
RPO28R2          EQU  H'0002'
RPO28R3          EQU  H'0003'
RPO29R0          EQU  H'0004'
RPO29R1          EQU  H'0005'
RPO29R2          EQU  H'0006'
RPO29R3          EQU  H'0007'


;----- RPOR30_31 Bits -----------------------------------------------------
RPO30R0          EQU  H'0000'
RPO30R1          EQU  H'0001'
RPO30R2          EQU  H'0002'
RPO30R3          EQU  H'0003'
RPO31R0          EQU  H'0004'
RPO31R1          EQU  H'0005'
RPO31R2          EQU  H'0006'
RPO31R3          EQU  H'0007'


;----- RPOR32_33 Bits -----------------------------------------------------
RPO32R0          EQU  H'0000'
RPO32R1          EQU  H'0001'
RPO32R2          EQU  H'0002'
RPO32R3          EQU  H'0003'
RPO33R0          EQU  H'0004'
RPO33R1          EQU  H'0005'
RPO33R2          EQU  H'0006'
RPO33R3          EQU  H'0007'


;----- RPOR34_35 Bits -----------------------------------------------------
RPO34R0          EQU  H'0000'
RPO34R1          EQU  H'0001'
RPO34R2          EQU  H'0002'
RPO34R3          EQU  H'0003'
RPO35R0          EQU  H'0004'
RPO35R1          EQU  H'0005'
RPO35R2          EQU  H'0006'
RPO35R3          EQU  H'0007'


;----- RPOR36_37 Bits -----------------------------------------------------
RPO36R0          EQU  H'0000'
RPO36R1          EQU  H'0001'
RPO36R2          EQU  H'0002'
RPO36R3          EQU  H'0003'
RPO37R0          EQU  H'0004'
RPO37R1          EQU  H'0005'
RPO37R2          EQU  H'0006'
RPO37R3          EQU  H'0007'


;----- RPOR38_39 Bits -----------------------------------------------------
RPO38R0          EQU  H'0000'
RPO38R1          EQU  H'0001'
RPO38R2          EQU  H'0002'
RPO38R3          EQU  H'0003'
RPO39R0          EQU  H'0004'
RPO39R1          EQU  H'0005'
RPO39R2          EQU  H'0006'
RPO39R3          EQU  H'0007'


;----- RPOR40_41 Bits -----------------------------------------------------
RPO40R0          EQU  H'0000'
RPO40R1          EQU  H'0001'
RPO40R2          EQU  H'0002'
RPO40R3          EQU  H'0003'
RPO41R0          EQU  H'0004'
RPO41R1          EQU  H'0005'
RPO41R2          EQU  H'0006'
RPO41R3          EQU  H'0007'


;----- RPOR42_43 Bits -----------------------------------------------------
RPO42R0          EQU  H'0000'
RPO42R1          EQU  H'0001'
RPO42R2          EQU  H'0002'
RPO42R3          EQU  H'0003'
RPO43R0          EQU  H'0004'
RPO43R1          EQU  H'0005'
RPO43R2          EQU  H'0006'
RPO43R3          EQU  H'0007'


;----- RPOR44_45 Bits -----------------------------------------------------
RPO44R0          EQU  H'0000'
RPO44R1          EQU  H'0001'
RPO44R2          EQU  H'0002'
RPO44R3          EQU  H'0003'
RPO45R0          EQU  H'0004'
RPO45R1          EQU  H'0005'
RPO45R2          EQU  H'0006'
RPO45R3          EQU  H'0007'


;----- RPOR46 Bits -----------------------------------------------------
RPO46R0          EQU  H'0000'
RPO46R1          EQU  H'0001'
RPO46R2          EQU  H'0002'
RPO46R3          EQU  H'0003'


;----- RPINR0_1 Bits -----------------------------------------------------
U1RXR0           EQU  H'0000'
U1RXR1           EQU  H'0001'
U1RXR2           EQU  H'0002'
U1RXR3           EQU  H'0003'
U1TXR0           EQU  H'0004'
U1TXR1           EQU  H'0005'
U1TXR2           EQU  H'0006'
U1TXR3           EQU  H'0007'


;----- RPINR2_3 Bits -----------------------------------------------------
U2RXR0           EQU  H'0000'
U2RXR1           EQU  H'0001'
U2RXR2           EQU  H'0002'
U2RXR3           EQU  H'0003'
U2TXR0           EQU  H'0004'
U2TXR1           EQU  H'0005'
U2TXR2           EQU  H'0006'
U2TXR3           EQU  H'0007'


;----- RPINR4_5 Bits -----------------------------------------------------
U3RXR0           EQU  H'0000'
U3RXR1           EQU  H'0001'
U3RXR2           EQU  H'0002'
U3RXR3           EQU  H'0003'
U3TXR0           EQU  H'0004'
U3TXR1           EQU  H'0005'
U3TXR2           EQU  H'0006'
U3TXR3           EQU  H'0007'


;----- RPINR6_7 Bits -----------------------------------------------------
U4RXR0           EQU  H'0000'
U4RXR1           EQU  H'0001'
U4RXR2           EQU  H'0002'
U4RXR3           EQU  H'0003'
U4TXR0           EQU  H'0004'
U4TXR1           EQU  H'0005'
U4TXR2           EQU  H'0006'
U4TXR3           EQU  H'0007'


;----- RPINR8_9 Bits -----------------------------------------------------
SCK1R0           EQU  H'0000'
SCK1R1           EQU  H'0001'
SCK1R2           EQU  H'0002'
SCK1R3           EQU  H'0003'
SDI1R0           EQU  H'0004'
SDI1R1           EQU  H'0005'
SDI1R2           EQU  H'0006'
SDI1R3           EQU  H'0007'


