PinguinoIDE/pinguino-compilers/linux/p8/share/gputils/header/p18f96j99.inc
;----- LCDDATA44 Bits -----------------------------------------------------
S32C5            EQU  H'0000'
S33C5            EQU  H'0001'
S34C5            EQU  H'0002'
S35C5            EQU  H'0003'
S36C5            EQU  H'0004'
S37C5            EQU  H'0005'
S38C5            EQU  H'0006'
S39C5            EQU  H'0007'


;----- LCDDATA45 Bits -----------------------------------------------------
S40C5            EQU  H'0000'
S41C5            EQU  H'0001'
S42C5            EQU  H'0002'
S43C5            EQU  H'0003'
S44C5            EQU  H'0004'
S45C5            EQU  H'0005'
S46C5            EQU  H'0006'
S47C5            EQU  H'0007'


;----- LCDDATA46 Bits -----------------------------------------------------
S48C5            EQU  H'0000'
S49C5            EQU  H'0001'
S50C5            EQU  H'0002'
S51C5            EQU  H'0003'
S52C5            EQU  H'0004'
S53C5            EQU  H'0005'
S54C5            EQU  H'0006'
S55C5            EQU  H'0007'


;----- LCDDATA47 Bits -----------------------------------------------------
S56C5            EQU  H'0000'
S57C5            EQU  H'0001'
S58C5            EQU  H'0002'
S59C5            EQU  H'0003'
S60C5            EQU  H'0004'
S61C5            EQU  H'0005'
S62C5            EQU  H'0006'
S63C5            EQU  H'0007'


;----- LCDDATA48 Bits -----------------------------------------------------
S00C6            EQU  H'0000'
S01C6            EQU  H'0001'
S02C6            EQU  H'0002'
S03C6            EQU  H'0003'
S04C6            EQU  H'0004'
S05C6            EQU  H'0005'
S06C6            EQU  H'0006'
S07C6            EQU  H'0007'


;----- LCDDATA49 Bits -----------------------------------------------------
S08C6            EQU  H'0000'
S09C6            EQU  H'0001'
S10C6            EQU  H'0002'
S11C6            EQU  H'0003'
S12C6            EQU  H'0004'
S13C6            EQU  H'0005'
S14C6            EQU  H'0006'
S15C6            EQU  H'0007'


;----- LCDDATA50 Bits -----------------------------------------------------
S16C6            EQU  H'0000'
S17C6            EQU  H'0001'
S18C6            EQU  H'0002'
S19C6            EQU  H'0003'
S20C6            EQU  H'0004'
S21C6            EQU  H'0005'
S22C6            EQU  H'0006'
S23C6            EQU  H'0007'


;----- LCDDATA51 Bits -----------------------------------------------------
S24C6            EQU  H'0000'
S25C6            EQU  H'0001'
S26C6            EQU  H'0002'
S27C6            EQU  H'0003'
S28C6            EQU  H'0004'
S29C6            EQU  H'0005'
S30C6            EQU  H'0006'
S31C6            EQU  H'0007'


;----- LCDDATA52 Bits -----------------------------------------------------
S32C6            EQU  H'0000'
S33C6            EQU  H'0001'
S34C6            EQU  H'0002'
S35C6            EQU  H'0003'
S36C6            EQU  H'0004'
S37C6            EQU  H'0005'
S38C6            EQU  H'0006'
S39C6            EQU  H'0007'


;----- LCDDATA53 Bits -----------------------------------------------------
S40C6            EQU  H'0000'
S41C6            EQU  H'0001'
S42C6            EQU  H'0002'
S43C6            EQU  H'0003'
S44C6            EQU  H'0004'
S45C6            EQU  H'0005'
S46C6            EQU  H'0006'
S47C6            EQU  H'0007'


;----- LCDDATA54 Bits -----------------------------------------------------
S48C6            EQU  H'0000'
S49C6            EQU  H'0001'
S50C6            EQU  H'0002'
S51C6            EQU  H'0003'
S52C6            EQU  H'0004'
S53C6            EQU  H'0005'
S54C6            EQU  H'0006'
S55C6            EQU  H'0007'


;----- LCDDATA55 Bits -----------------------------------------------------
S56C6            EQU  H'0000'
S57C6            EQU  H'0001'
S58C6            EQU  H'0002'
S59C6            EQU  H'0003'
S60C6            EQU  H'0004'
S61C6            EQU  H'0005'
S62C6            EQU  H'0006'
S63C6            EQU  H'0007'


;----- LCDDATA56 Bits -----------------------------------------------------
S00C7            EQU  H'0000'
S01C7            EQU  H'0001'
S02C7            EQU  H'0002'
S03C7            EQU  H'0003'
S04C7            EQU  H'0004'
S05C7            EQU  H'0005'
S06C7            EQU  H'0006'
S07C7            EQU  H'0007'


;----- LCDDATA57 Bits -----------------------------------------------------
S08C7            EQU  H'0000'
S09C7            EQU  H'0001'
S10C7            EQU  H'0002'
S11C7            EQU  H'0003'
S12C7            EQU  H'0004'
S13C7            EQU  H'0005'
S14C7            EQU  H'0006'
S15C7            EQU  H'0007'


;----- LCDDATA58 Bits -----------------------------------------------------
S16C7            EQU  H'0000'
S17C7            EQU  H'0001'
S18C7            EQU  H'0002'
S19C7            EQU  H'0003'
S20C7            EQU  H'0004'
S21C7            EQU  H'0005'
S22C7            EQU  H'0006'
S23C7            EQU  H'0007'


;----- LCDDATA59 Bits -----------------------------------------------------
S24C7            EQU  H'0000'
S25C7            EQU  H'0001'
S26C7            EQU  H'0002'
S27C7            EQU  H'0003'
S28C7            EQU  H'0004'
S29C7            EQU  H'0005'
S30C7            EQU  H'0006'
S31C7            EQU  H'0007'


;----- LCDDATA60 Bits -----------------------------------------------------
S32C7            EQU  H'0000'
S33C7            EQU  H'0001'
S34C7            EQU  H'0002'
S35C7            EQU  H'0003'
S36C7            EQU  H'0004'
S37C7            EQU  H'0005'
S38C7            EQU  H'0006'
S39C7            EQU  H'0007'


;----- LCDDATA61 Bits -----------------------------------------------------
S40C7            EQU  H'0000'
S41C7            EQU  H'0001'
S42C7            EQU  H'0002'
S43C7            EQU  H'0003'
S44C7            EQU  H'0004'
S45C7            EQU  H'0005'
S46C7            EQU  H'0006'
S47C7            EQU  H'0007'


;----- LCDDATA62 Bits -----------------------------------------------------
S48C7            EQU  H'0000'
S49C7            EQU  H'0001'
S50C7            EQU  H'0002'
S51C7            EQU  H'0003'
S52C7            EQU  H'0004'
S53C7            EQU  H'0005'
S54C7            EQU  H'0006'
S55C7            EQU  H'0007'


